{
  "main": {
    "name":"John Gordley",
    "occupation":"Computer Science and Engineering Student",
    "description":"I have a drive for social work and I am looking for practical experiences that will build me into someone capable of large-scale positive change",
    "image":"prof.png",
    "bio":"I love to program new web applications. I am also very interested in video game development, specifically educational game development. You can find me on the Notre Dame soccer fields or the planetarium in my free time, as I am a member of the Club Soccer team and the DVT tech team. I also like to workout and go on runs to keep my mind and body healthy!",
    "contactmessage":"Want to work with me? Get in touch below.",
    "email": "jgordley@nd.edu"
  },
  "resume":{
    "skillmessage":"My skills based on previous internship/work experience.",
    "education":[
      {
        "school":"University of Notre Dame",
        "degree":"BS in Computer Science and Engineering",
        "graduated":"August 2018-Current, 3.63 GPA",
        "description":"Loving life at a university focused on social change and making a commmunity impact. The football is pretty fun too."
      },
      {
        "school":"Center for Network Data Science at Notre Dame",
        "degree":"Interdisciplinary Traineeship for Socially Responsible and Engaged Data Scientists (iTREDS)",
        "graduated":"August 2020-Current",
        "description":"Working to develop an in-depth data science background as well as communication, critical thinking, teamwork, and other skills necessary for professional development."
      }
    ],
    "work":[
      {
        "company":"Telnyx LLC",
        "title":"Computer Engineering Intern",
        "years":"May 2020 - August 2020",
        "description":"Implemented rigorous validation checks using Python to ensure a consistent documentation development process through the Swagger API. Developed Call Control and Messaging project content for users of the Telnyx Platform to use for self-service and learning through tutorials and documentation."
      },
      {
        "company":"Notre Dame Digital Visualization Theater",
        "title":"Student Research Assistant",
        "years":"September 2019 - Current",
        "description":"Using Python auto-generation to update demonstrations in the DVT while also assisting in presentations covering astronomy, climate change, and physics."
      },
      {
        "company":"Ambifi, Inc.",
        "title":"Software Development Intern",
        "years":"May 2019 - September 2019",
        "description":"Created an online documentation service from scratch using React.js to assist product users and instituted user experience improvements to the React Native app including color theme generation and mobile scaling."
      }
    ],
    "skills":[
      {
        "name":"Reactjs",
        "level":"90%"
      },
      {
        "name":"Python Development",
        "level":"95%"
      },
      {
        "name":"C/C++ Development",
        "level":"80%"
      },
      {
        "name":"HTML5/CSS",
        "level":"100%"
      },
      {
        "name":"REST API development with firebase/aws",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Iceburgh Connections Tracker",
        "category":"A free networking and job search tracker for students built using React.js and Firebase.",
        "image":"iceburgh-img.png",
        "url":"https://www.iceburgh.app"
      },
      {
        "title":"Time Left on Stuff",
        "category":"A task manager based on time. Allocate tasks and play them when they are in progress, built with React.js and Firebase.",
        "image":"tlos-img.png",
        "url":"http://www.cheetahtask.com"
      },
      {
        "title":"Rock Roller vs. Paper",
        "category":"A video game I made for weekly game jam 154 on itch.io. The theme was rock, paper, scissors.",
        "image":"rock-img.png",
        "url":"https://jgordley.itch.io/rock-roller-vs-paper"
      }
    ]
  }
}
